Tekla Open API Reference for Tekla Structures 2025
IEvents.ModelLoad Event
 The ModelLoad event is raised just after a model has been loaded.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ModelLoadDelegate ModelLoad
Event ModelLoad As Events.ModelLoadDelegate
Value
Type: Tekla.Structures.Model.Events.ModelLoadDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace